Revit 2027 API
Speckle.SpeckleColor2 Property
 The property labeled "Color 2" from the "Speckle" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SpeckleColor2 { get; }
Public Shared ReadOnly Property SpeckleColor2 As String
	Get
public:
static property String^ SpeckleColor2 {
	String^ get ();
}
static member SpeckleColor2 : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Speckle Class
Autodesk.Revit.DB.Visual Namespace